_____________________________________________________________________________________________________________________________________________________

# Итоговая проверочная работа

_____________________________________________________________________________________________________________________________________________________

Данная работа необходима для проверки ваших знаний и навыков по итогу прохождения первого блока обучения на программе разработчик. Мы должны убедиться что базовое знакомство с it прошло успешно.

Задача алгоритмически не самая сложная, однако для полценного выполнения проверочной работы необходимо:

* создать репозиторий на GitHub
* нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете ее в отдельный метод)
* снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
* написать программу, решающую поставленную задачу
* использовать контроль версий в работе над этим небольшим проектом (не должно быть так что все залито одним коммитом, как минимум этапы 2, 3 и 4 должны быть расположены в разных коммитах)

_____________________________________________________________________________________________________________________________________________________

## Задача

_____________________________________________________________________________________________________________________________________________________

Написать программу, которая из имеющегося массива целых чисел формирует массив из четных чисел. Первоначальный массив можно ввести с клавиатуры, либо сгенерировать случайным образом. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:

[1, 2, 3, 4] -> [2, 4]
[1, 3, 4, 5, 7, 1, 3] -> [4]
[2, -4, 6] -> [2, -4, 6]
[1, 3, 5] -> []

_____________________________________________________________________________________________________________________________________________________

## Блок-схема

_____________________________________________________________________________________________________________________________________________________

https://viewer.diagrams.net/?tags=%7B%7D&highlight=0000ff&edit=_blank&layers=1&nav=1&title=block_diagram.drawio#R5Vpbk5s2FP41PDYDEmD8GGynmUlzab2TZvumNVpggxER8trur68kBFjIjtmubZzdGY8GHV2QzjnfuRkLTpab3ykqko8kwpkF7GhjwakFgOMCYImfHW0ryigYV4SYppGa1BLm6b9YEW1FXaURLrWJjJCMpYVOXJA8xwum0RClZK1PuyeZ%2FtYCxdggzBcoM6l%2FpxFLKmoARi39PU7jpH6z46v7LVE9Wd2kTFBE1jskOLPghBLCqqflZoIzwbyaL9W6dwdGm4NRnLM%2BC6ZfP3vv%2FvlKndvpD4L%2BxB%2BiCP%2BmpFOybX1hHPH7qy6hLCExyVE2a6khJas8wmJXm%2FfaOX8QUnCiw4kPmLGtEiZaMcJJCVtmahRvUvZNLH%2Fjqd7tzsh0o3aWna3qVOcUhzt4fUUqyYou8E%2Fu7DTM51qLyRIzuuXrKM4QSx%2F1%2FZFSn7iZ1yz9QlL%2BZmArVXcdt1qiFH1s6zswRGPM1KJWTPxh5xQtSQrvCYJU531E2UrdYH7z9q8bU7xZxqEjxLhOUobnBZK8WnP06kJS%2B2HK8ObnLDdZqRZAT2dJjel1CySnRkeyAyLfPsx8jW9PZZI%2FhLafUHPhRTQXePCiqgsN1bU4r8eyDat2Jlt%2BTFs9iDaUbSDbqcV5HXBe%2B2gpFDm%2FKwvJez%2FjPA7vKH%2BKxZOcPZGtLdc4ddvsBdSocCordeVdnWk1whkGRj4cGEdjU2K%2FNrDcMwHL0wQH3csCy%2F2fwLJrSO0AS7RePa0nfo5hkcdnaOsYqjM0vhr7Nxi%2BRi8NXwoHlb6f0cE9i%2BuewfVaQfcqLjDpqWS2Qa7ciBy6MlUPho7IHDNuvW5VP6rCjr1fAif2JS7o%2BJIKg%2BfLL15cpnh%2BEcF%2B7v76ZG1awusG5fGU3%2B6L3udGgs%2ByhrWcf3E%2BnxxZjmtrgPC6gDh3ccU2ASEi6b15qModVezg8aDA4wsmTTgsgwO%2BiSlrmpDl3aq8SCQAPJ2l7p6kEsI9oUATH5w%2BFnhxYW9dWDludvwhzY5jJooqwvXCB6G9nE26Nncj3AcLhPJ3ML61L6PVo7Gm1b5jajUYXTLArXV4YKXm%2FKPbb3W4JDq3bVglum0sJXvnKLv7PcEAz1ON6Vo8GFzYifjHNaFMUCHBgbaFPAcMy%2B%2BYLRIljrKSr88f5Tims0cuiFJJWdLkbbxQ4ja8T7NsQjJCOTHC92glgUsx3wjdybfaUr0YYjv9AtOUXxeLVQssXvOlpYRljoobUvGpeq%2BunifAceNkalnt8U7uHhi7Z4Pxi%2FNNoK9vAoP6JnC4iFnVJQ%2BVMvvWKA%2BUdgZ2ZH4XAIPXJIFpvmafpiYI%2Bv6%2FeHKb0WWZOx6cZYHBsk%2BfDY7xGzOdNShL47wxvZwg%2BJIuUPZWDSzTKKoMSseQmw5A2BDlNcTWJaPkO649Qk5y3HESinQKGx505BEEvWw4PJs4zL%2BtbmfzVyMP19arSt7IlId3SXlAM6t%2BzfJwwdDyMFOVV2yufGdgcwXN7yJesTigN7Q4Bvl46Arydtg7URi0dg7NREH9HTuxtK8bZpYqzr7JcB5zXTqUhCd4g7i0OvmwojYJMTge6t6nG1x%2F2uq0WTw4UeAL7Q5U3D1Fr32l3ODpWOHd9ovVqjLSfvcLZ%2F8B
_____________________________________________________________________________________________________________________________________________________

## Алгоритм решения

_____________________________________________________________________________________________________________________________________________________

* Начинаем формирование кода с "Console.Clear();"
* Добавляем описание задания
* Задаем массивы строк и назначаем переменные
* Поскольку отсутствует конкретное требование к размеру массива, мы задаем данные вручную. Для этого используем переменную "count"
* Выделяем память для массива из "count" строк. Размер "массива №2", содержащего конечный результат, принимаем за массива №1 <(размер массива 2 может быть <= размеру "массива №1", но не больше него)>
* Запускаем цикл для ввода строк массива с клавиатуры
* Проверяем соответсвие элементов массива требованию задания и формируем "массив №2". Для этого запускаем цикл для поэментного сравнения длины строк "массива №1". Если текущая длина строки массива <=3, то записывае данную строку в "массив №2". При заполнении "массива №2" используется переменная "j", в которой сохраняется текущий индекс элемента.
При достижении счетчиком максимального значения <(размер массива), цикл завершается.
* Выводим элементы "массива №2" на экран.

_____________________________________________________________________________________________________________________________________________________

## Написание кода

_____________________________________________________________________________________________________________________________________________________

Console.Clear();
Console.WriteLine($"Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3.");
string[] array1;
string[] array2;
int count;
int j = 0;
Console.Write("Количество элеметов массива: ");
count = Int32.Parse(Console.ReadLine());
array1 = new string[count];
array2 = new string[count];
Console.WriteLine("Введите массив из строк:");
for (int i = 0; i < array1.Length; i++)
{
    Console.Write("Элемент массива [{0}] = ", i);
    array1[i] = Console.ReadLine();
}
for (int i = 0; i < array1.Length; i++)
    if (array1[i].Length <= 3)
    {
        array2[j] = array1[i];
        j++;
    }
Console.Write("Массив из строк, длина которых меньше либо равна 3: [  ");
for (int i = 0; i < array2.Length; i++)
    Console.Write("{0} ", array2[i]);
Console.Write("] ");
Console.ReadKey();
